 {
    "blogs": [
        {
        "id": "blog1",
        "title": "Blog Week #1",
        "date": "02/24/2018",
        "post": "<p>Wow. What a couple of weeks this has already been. I ask people in passing if I look like a deshelved empty shell of a person. Usually, they look at me funny and confused. I then figure, I must look better than I feel.</p><p>Anywho, I guess what I am really supposed to be doing is writing about what I have learned. I have already learned a lot. Let me break it down by topic.</p><p><strong>HTML: </strong>I did not know how to create an abbreviated text tag.  I also figured out how to wrap those in anchor tags. Lastly, I now have an understanding of how to categorize my tags and how to use clean markup to use in tandem with CSS.</p><p><strong>CSS: </strong>I will start by saying, I really dislike this stuff. I do not mind the colors and fonts and sizing aspects, but when it comes to columns, I would love to be using boostrap instead of this stuff. I also really hate specificity, because I feel like CSS can be a little wonky when it wants to be, even when you feel like you are doing all the right things. That being said, I feel like the more I work with it the better I am getting.  I am just ready for the day when CSS does not feel like the perpetual thorn in my side that it currently is.</p><p><strong>GIT: </strong>This stuff is scary. I really did not understand this stuff after treehouse, but I feel like I have a much better understanding of this now. I understand how to use my terminal and command line.  I know how to make a repository, make a branch, figure out what branch I am on and how to commit that to github.  While, it still confuses me and I do things wrong sometimes, I feel accomplished for learning those things.</p><p><strong>github: </strong>Ok, this still confuses me. I am starting to 'get' it, but pull requests and merging still make me feel very nervous.  Right now, I feel like I am going through motions.  I think I will understand it better in the coming weeks and I am looking forward to that.</p>"
        },
        {
        "id": "blog2",
        "title": "Blog Week #2",
        "date": "03/03/2018",
        "post": "<p>This week started out feeling a little bit better.  I felt like I was starting to absorb GIT and github and I was also ready to move onto JS. I learned quickly that I would soon regret that thought process. I felt good on the lesson on arrays until we got to the group homework.</p><p>I have two words for you. RED CARD.</p><p><strong>GIT and github: </strong> I feel like I understand branches, PRs and merging a lot better. Some of the command line still trips me up at times, but I feel like I at least understand the basics of this stuff and don't feel lost anymore.  What I liked learning the most about this section was how to commit and push branches as well as to use hs to open windows.</p><p><strong>JS: </strong>Oh JS, how I love and hate thee. I was actually looking forward to JS becuase I didn't struggle with it during the prework and I am mathematically minded, so I felt like I would understand JS pretty well. What I didn't understand is that JS has a very specific way of doing things which doesn't always match up with what you are thinking.</p><p>I learned some very valuable lessons.  I realized that in order to print to the DOM via JS, you have to put document. before getElementById or it won't work.  I spent a few hours trying to figure out why I couldn't see an answer to challenge only to find out I forgot the the document. piece.</p><p>My other big valuable lesson this week was remembering to put the script tags in my html near the bottom of the body tags. I could have salvaged so much happiness had I remembered to do that.</p><p>Overall, I feel as though this class is one long version of 'Karate Kid' and that at some point I will understand all of what I'm doing and it will all come down to one big 'I got Miyagied moment'. That's my hope anyway.</p>"
        },
        {
        "id": "blog3",
        "title": "Blog Week #3",
        "date": "03/10/2018",
        "post": "<p>So...this week I felt better going into it because I worked on the JS objects homework and got through it for the most part. I got stuck on the first excercise for a bit, but I worked through it and then the other excercises seemed to come a lot faster and easier. However, when we went over some of the functions material and advanced function methods, I felt about as lost as Nemo. Things got a little bit better when we went over project planning, as I do that in my job in a different capacity almost everyday.  I am ready for JS advanced methods to make more sense.</p><p><strong>JS: </strong>I get confused in the following areas: advanced array methods, function placeholders, and variable names within functions. I think a next step I'm going to try and take is to read over some of the extra JS material as well breakdown functions like algebraic equations.  I get very confused by the variable and placeholder names, epsecially if they are similar to other variable or function names.</p><p>What I would like to do is replace variable names and placeholders with algebra variables like a, b and c or x, y and z.  I would then like to see if I better absorb how functions work.</p><p><strong>Project Planning:</strong>This part was enjoyable and a nice break from the madness. What I learned from this session is that planning is key. I enjoyed walking through the steps of planning from the bare bones of what the project needs as an MVP, to wireframes, to ticketing. I think this process will really help our group work be more efficient and cohesive.</p>"
        },
        {
        "id": "blog4",
        "title": "Blog Week #4",
        "date": "03/23/2018",
        "post": "<p>This week felt better overall. After our group project and working on the advanced array method for the project, I feel better about JS functions and JS in general. I still need more practice to get really comfortable, but I at least don't feel lost anymore.</p><p><strong>ES6: </strong>Using const and let took a little bit of time to grasp, but I feel like the more I use them the easier it will be to use them and know when to. I sort of try to think about when to use them like I do when I'm choosing an id or a class in CSS as far as uniqueness goes.</p><p><strong>DOM Interaction: </strong>Going over event listeners helped me quite a bit to understand why I could not get text to print to the DOM in the language translator challenge. The function I was trying to use in the language translator was being called before the page loaded which meant any input a user typed in would not print. That was a hugely valuable lesson to me. Also traversing the DOM using parent.node made a lot of sense to me.  It reminds me a lot of cd in the terminal.  I think having a better understanding of git helped a lot for that lesson.</p><p><strong>Markdown: </srong>Markdown seems easy enough.  It's another CSS type thing where we are supposed to be good at looking up how to do it instead of learning it directly. Again, I think the more we use it, the easier it will be to write README files.</p>"
        },
        {
        "id": "blog5",
        "title": "Blog Week #5",
        "date": "04/01/2018",
        "post": "<p><strong>JSON: </strong>This stuff seems easy enough. The main takeaways for me were that you have to put everything - inlcuding - keys in double quotes and that you can't put comments in JSON. Otherwise, this seems pretty straight forward.</p><p><strong>XHR: </strong>I'm not sure how I feel about this yet. It seems to makes sense, but I am not sure I will fully understand it until we get to the back end. I didn't feel lost this week, but I'm not sure if that's because I have accepted the fact that I will not understand everything fully immediately, but I know as we go I will catch on to all of this. Anyway, I like learning these types of things because I understand how important being able to pull data in from somewhere else is for future use. I think I will appreciate XHR much more in time. Also, the part that interested me most was th sync vs. async piece.  I think this will actually help me understand some things from my current job due to the way script tags in ad ops run async or sync and how that affects ad calls. I'm interested to see how this works with the back end in the future.</p>"
        },
        {
        "id": "blog6",
        "title": "Blog Week #6",
        "date": "04/08/2018",
        "post": "<p><strong>Overall: </strong>I feel like I’ve had a small turning point this week of understanding event listeners and functions better and how that works with the other working pieces of building these applications.  I worked with Callan on walking through lines of code one at a time and focusing on methods that I can uses on different elements using typeof.  I worked with Lauren on making a more advanced writeToDom function and traversing the DOM. I also worked with Zoe on better understanding event listeners and making multiple XHR requests. Overall, I feel more confident, less lost and finally like this stuff is starting to click bit by bit.</p><p><strong>Boostrap: </strong>I like Bootstrap.  It’s super logical and easy to use.  I only have 2 frustrations with Bootstrap thus far.</p><ol><li>I was just getting to feel really good about flexbox and css rules and now I can’t use flexbox the same way.</li><li>I think where I might run into trouble with Bootstrap in the future is how much you can customize it.</li></ol><p>Otherwise, I am a fan of Bootstrap.</p><p><strong>XHR: </strong>Oye.  Here’s the thing - I get how calling a function (or another XHR call) into an XHR call works in theory.  I understand when we walk through it in class - I’m just not to the level of being comfortable with it yet. I know that will come and that’s the only thing that gives me peace at night with all of the coding things I don’t understand.</p>"
        },
        {
        "id": "blog7",
        "title": "Blog Week #7",
        "date": "04/15/2018",
        "post": "<p><strong>Task Runners: </strong>Grunt is sooooo fun - not.  Truthfully, I think Grunt will end up being very helpful by calling out errors before running an application, but it still can be frustrating for the little things it calls out.  I do understand the purpose of it though and it is a great tool for uniformity and consistency.</p><p><strong>Browserify: </strong>This is taking some time to get used to but, I understand the value in it.  Using modules is strange, but in a way, linking JS files in which each file serves its own purpose sort of helps keep things clean and neat. I look forward to feeling comfortable using it.</p>"
        },
        {
        "id": "blog8",
        "title": "Blog Week #8",
        "date": "04/20/2018",
        "post": "<p><strong>Task Runners and Browserify: </strong>This week has been enlightening.  As we coded along in class both Monday and Tuesday, I felt like I understood to some degree what was happening but I also felt overwhelmed by all the files and all the functions being inside of those separate files.  Anyway, given that I knew on Tuesday night that this week was going to be overwhelming, I decided to spend my group night going over our repos from Monday and Tuesday. I think that was the best thing I could have done because I now have a much better understanding of how all of this works and what these functions mean.  Earlier this week, I felt like I knew that I needed certain pieces to make something work, but I didn’t know why I needed them.  Now, I feel like I have a much better understanding of why I need certain things in my code and I’m going to try to make it a goal to focus on going over our weekly repos line by line every time we learn something new. Overall, this was a very big lesson learned for me this week.</p>"
        },
        {
        "id": "blog9",
        "title": "Blog Week #9",
        "date": "05/01/2018",
        "post": "<p><strong>Chatty Papaphobia: </strong>This project was a good learning experience. We took a lot of time planning and got a little bit behind because we made cards individually to try to knock them out faster.  This caused a lot of duplication and therefore a lot of extra time to fix the duplication.  Next time, I think it would be better to go through project altogether a few times and stop trying to get ahead on certain pieces.</p><p>My portion of the project ended up being JS setup and mostly focused on the CSS themes and how to flip them out in JS.  It was a good challenge and I learned a lot about how I would change themes in the future and the right and wrong ways to do it.  The biggest lesson to me (knowing what I know now) would be to create the theme flipper function first and just apply a solid background color to make sure it worked and then once it worked, to individually style themes instead of trying to add and subtract styling adjustments piecemeal.  I also learned some cool CSS tricks I didn’t know before because of this project. Overall, it was a good learning experience and I feel more prepared for our next project because of it.</p>"
        },
        {
        "id": "blog10",
        "title": "Blog Week #10",
        "date": "05/06/2018",
        "post": "<p><strong>JQuery: </strong>I can already tell JQuery and I are going to be friends.  During the lectures, I felt much better about JS because of the simplified logic of JQuery.  It’s going to take some getting used to after using the advanced JS methods, because now I’m trying to figure out where I can use JQuery instead and I am tending to overthink problems.  I am still struggling with over thinking event listeners, but I’m hoping the more I practice JQuery the better I will get at them.  Overall, I’m excited to get used to JQuery and using it instead of the more complex JS methods.</p>"
        },
        {
        "id": "blog11",
        "title": "Blog Week #11",
        "date": "05/20/2018",
        "post": "<p><strong>Promises: </strong>Oh promises promises promises...I'm not sure what to think of you yet.  I think promises will be helpful and thus far I like the methodology behind them.  I like the idea of having better understanding on the front end of when I need my data and how some data is dependant upon other data.  I think I will get more comfortable with promises as I use them and I hope to have better understanding of when to use chaining vs. .all as we go. I also hope to have a better understanding of some of the inner workings of promises as we go.</p>"
        },
        {
        "id": "blog12",
        "title": "Blog Week #12",
        "date": "05/25/2018",
        "post": "<p><strong>APIs: </strong>APIs seem a little scary as far as how easy it is to mistakenly push your API key to github.  I guess that was a good takeaway for me though that I will try to be super careful to make sure I don't do that. Otherwise, being able to use APIs is exciting to me because it means I can start utilizing data that is already  built. As far as coding how to use it, I think that will get easier with time.</p>"
        },
        {
        "id": "blog13",
        "title": "Blog Week #13",
        "date": "06/02/2018",
        "post": "<p><strong>Firebase: </strong>I'm excited for this funcitonality and I think that aspects of some of the backend type utilizations make a lot of sense to me. Determining how the data needs to be grouped reminds me of creaeting Excel databases which I do a lot at work. As far as implementing Firebase, I need some work on it.  Tuesday's lecture I was struggling due to a really intense workday prior to class, but I'm hoping the more I work on it, the more the concepts are solidified. I generally understand how firebase works, I just need more time to work on it.</p>"
        },
        {
        "id": "blog14",
        "title": "Blog Week #14",
        "date": "06/17/2018",
        "post": "<p><strong>Firebase Auth: </strong>The authorization part of Firebase seems to be more of a process that we have to run through specifically for Firebase, rather than coding via multiple options of executing the process.  It seems like a fairly straightforward process, I will just need more practice with it to get comfortable using it. As far as using it, I am excited to start using and understand this functionality.</p>"
        }
    ]
}
